# 1.В моем понимании, это программа, которая облегчает каждому разработчику
# 1.2 Для создании сайтов, веб приложения
# 2.Язык по базе данным
# 2.2 SELECT * FROM [название таблицы]
# 3.ORM - связь между ООП и базой данных
# 3.2 В admin site
# 4.Инкапсуляция - принцип, в котором главное слово - ограничение
# Наследование - наследует с другого класса
# Композиция - может брать компоненты с другого класса
# 5. Ассоциация - есть класс Car, у него свои обьекты, затем мы создаем класс BMW и берем обьект с Car
# Агрегация - то же самое может взаимствовать у другого класса /
